
Feature: Вход в системата

  Scenario: Вход в системата с валидни потребителски данни
    Given Потребителят отваря екрана за вход в системата
    When Въвежда потребителско име "Ivan"
    And Въвежда паролата "123"
    And Натиска бутона за вход в системата 
    Then Вижда съобщение за "OK".
    
   Scenario: Вход в системата с грешни данни
    Given Потребителят отваря екрана за вход в системата
    When Въвежда потребителско име "IvanVazon"
    And Въвежда паролата "666"
    And Натиска бутона за вход в системата 
   	Then Вижда съобщение за "Error".
   	
   Scenario: Вход в системата без име
    Given Потребителят отваря екрана за вход в системата
    When Въвежда паролата "666"
    And Натиска бутона за вход в системата 
   	Then Вижда съобщение за "Error".
   	
   Scenario: Вход в системата без парола
    Given Потребителят отваря екрана за вход в системата
    When Въвежда потребителско име "IvanVazon"
    And Натиска бутона за вход в системата 
   	Then Вижда съобщение за "Error".
   	
   Scenario: Вход в системата с празни полета данни
    Given Потребителят отваря екрана за вход в системата
    And Натиска бутона за вход в системата 
   	Then Вижда съобщение за "Error".
